---
kind: method
id: M:Autodesk.Revit.DB.Mechanical.MEPSection.GetElementIds
source: html/a09a0a4c-d28d-c0d4-ed85-b2481a0ac9dd.htm
---
# Autodesk.Revit.DB.Mechanical.MEPSection.GetElementIds Method

Gets all element ids that are contained in the section.

## Syntax (C#)
```csharp
public IList<ElementId> GetElementIds()
```